{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "EsmForMaskedLM",
    "parent_library": "transformers.models.esm.modeling_esm"
  },
  "base_model_name_or_path": "facebook/esm2_t33_650M_UR50D",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query",
    "key"
  ],
  "task_type": null
}